Tekla Open API Reference for Tekla Structures 2025
Operation.DisplayReport Method
 Opens and displays a report with the given name.
If a path is not given in the filename, the file is searched from the folder defined with the advanced option XS_REPORT_OUTPUT_DIRECTORY.
See Tekla Structures Help for more information about reports.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool DisplayReport(
	string FileName
)
Public Shared Function DisplayReport (
	FileName As String
) As Boolean
Parameters
FileName
Type: System.String
The name of the report to display. The name must contain more than three characters.
Return Value
Type: Boolean
True if the report existed.
Exceptions
Exception | Condition
ArgumentException | Thrown when the file specified in the FileName is not found or when the FileName is too short.
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace